# St7GetGeometryCoedgeEdge

Returns the edge number of a coedge.  More than one coedge can be associated with a single edge.

long St7GetGeometryCoedgeEdge(long uID, long CoedgeNum, long* EdgeNum)

Input Parameters

uID

Strand7 model file ID.

Entities – Geometry

CoedgeNum

Coedge number.

Output Parameters

EdgeNum

Edge number.